# COMBINING OF DATA FRAMES

In [1]:
import pandas as pd
import numpy as np

## Concatination

Directly 'glue' together dataframes.

In [2]:
data_one = {'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4']}

In [3]:
data_two = {'C':['C1','C2','C3','C4'],'D':['D1','D2','D3','D4']}

In [4]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [5]:
one

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [6]:
two

    C   D
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

## AXIS = 0

###  Concatenate along rows

In [7]:
axis0 = pd.concat([one,two],axis = 0)

In [8]:
axis0

     A    B    C    D
0   A1   B1  NaN  NaN
1   A2   B2  NaN  NaN
2   A3   B3  NaN  NaN
3   A4   B4  NaN  NaN
0  NaN  NaN   C1   D1
1  NaN  NaN   C2   D2
2  NaN  NaN   C3   D3
3  NaN  NaN   C4   D4

## AXIS = 1

###  Concatenate along rows

In [9]:
axis1 = pd.concat([one,two],axis = 1)

In [10]:
axis1

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [11]:
axis11 = pd.concat([two,one],axis = 1)

In [12]:
axis11

    C   D   A   B
0  C1  D1  A1  B1
1  C2  D2  A2  B2
2  C3  D3  A3  B3
3  C4  D4  A4  B4

### Axis 0 , but columns match up
**In case you wanted this:**

In [13]:
two.columns = one.columns

In [14]:
pd.concat([one,two])

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

# Merge

## Data Tables

In [23]:

registrations = pd.DataFrame({'reg_id':[1,2,3,4],'Name':['Wang','Claire','Andrew','Davide']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'Name':['Xavire','Andrew','Yolanda','Wang']})

In [24]:
registrations

   reg_id    Name
0       1    Wang
1       2  Claire
2       3  Andrew
3       4  Davide

In [17]:
logins

   log_id     Name
0       1   Xavire
1       2   Andrew
2       3  Yolanda
3       4     Wang

# pd.merge()

Merge pandas DataFrames based on key columns, similar to a SQL join. Results based on the **how** parameter.

In [18]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left: 'DataFrame | Series', right: 'DataFrame | Series', how: 'str' = 'inner', on: 'IndexLabel | None' = None, left_on: 'IndexLabel | None' = None, right_on: 'IndexLabel | None' = None, left_index: 'bool' = False, right_index: 'bool' = False, sort: 'bool' = False, suffixes: 'Suffixes' = ('_x', '_y'), copy: 'bool' = True, indicator: 'bool' = False, validate: 'str | None' = None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    A named Series object is treated as a DataFrame with a single named column.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.
    When performing a cross merge, no column specifications to merge on are
    allowed.

    .. warning::

        If both key columns contain rows where the key is a null value, those
        rows will be matched against each other. This is different from usual SQL
        join behaviour and can lead to unexpected results.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
        * cross: creates the cartesian product from both frames, preserves the order
          of the left keys.

          .. versionadded:: 1.2.0

    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : list-like, default is ("_x", "_y")
        A length-2 sequence where each element is optionally a string
        indicating the suffix to add to overlapping column names in
        `left` and `right` respectively. Pass a value of `None` instead
        of a string to indicate that the column name from `left` or
        `right` should be left as-is, with no suffix. At least one of the
        values must not be None.
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to the output DataFrame called "_merge" with
        information on the source of each row. The column can be given a different
        name by providing a string argument. The column will have a Categorical
        type with the value of "left_only" for observations whose merge key only
        appears in the left DataFrame, "right_only" for observations
        whose merge key only appears in the right DataFrame, and "both"
        if the observation's merge key is found in both DataFrames.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------
    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

    >>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
    >>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
    >>> df1
          a  b
    0   foo  1
    1   bar  2
    >>> df2
          a  c
    0   foo  3
    1   baz  4

    >>> df1.merge(df2, how='inner', on='a')
          a  b  c
    0   foo  1  3

    >>> df1.merge(df2, how='left', on='a')
          a  b  c
    0   foo  1  3.0
    1   bar  2  NaN

    >>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
    >>> df2 = pd.DataFrame({'right': [7, 8]})
    >>> df1
        left
    0   foo
    1   bar
    >>> df2
        right
    0   7
    1   8

    >>> df1.merge(df2, how='cross')
       left  right
    0   foo      7
    1   foo      8
    2   bar      7
    3   bar      8

# Inner,Left, Right, and Outer Joins

## Inner Join

**Match up where the key is present in BOTH tables. There should be no NaNs due to the join, since by definition to be part of the Inner Join they need info in both tables.**
**Only Andrew and Bobo both registered and logged in.**

In [25]:
# Notice pd.merge doesn't take in a list like concat
pd.merge(registrations,logins,how = 'inner',on = 'Name')

   reg_id    Name  log_id
0       1    Wang       4
1       3  Andrew       2

In [26]:
# pandas smart enough to figure out key column (on parameter) if only one column name matches up
pd.merge(registrations,logins,how = 'inner')

   reg_id    Name  log_id
0       1    Wang       4
1       3  Andrew       2

### Left Join 

**Match up AND include all rows from Left Table.**
**Show everyone who registered on left Tableif they don't have login info, then fill with NaN**

In [27]:
pd.merge(registrations,logins,how='left')

   reg_id    Name  log_id
0       1    Wang     4.0
1       2  Claire     NaN
2       3  Andrew     2.0
3       4  Davide     NaN

### Right join
**Match up AND include all rows from Right Table.**
**Show everyone who logged in on the Right Table, If they don't have registration info, then fill with NaN.**

In [28]:
pd.merge(registrations,logins,how='right')

   reg_id     Name  log_id
0     NaN   Xavire       1
1     3.0   Andrew       2
2     NaN  Yolanda       3
3     1.0     Wang       4

In [29]:
registrations

   reg_id    Name
0       1    Wang
1       2  Claire
2       3  Andrew
3       4  Davide

In [72]:
logins

   log_id     Name
0       1   Xavire
1       2   Andrew
2       3  Yolanda
3       4     Wang

## Outer join

**Match up on all info found in either Left or Right Table.**
**Show everyone that's in the Log in table and the registrations table.Fill amy missing ifo with NaN.**

In [35]:
pd.merge(registartions,logins,how='outer' )

   reg_id     Name  log_id
0     1.0     Wang     4.0
1     2.0   Claire     NaN
2     3.0   Andrew     2.0
3     4.0   Davide     NaN
4     NaN   Xavire     1.0
5     NaN  Yolanda     3.0

### join on index or column
**Use combinations of left_on,right_on,left_index,right_index to merge a column or index on each other**

In [36]:
registartions

   reg_id    Name
0       1    Wang
1       2  Claire
2       3  Andrew
3       4  Davide

In [37]:
logins

   log_id     Name
0       1   Xavire
1       2   Andrew
2       3  Yolanda
3       4     Wang

In [53]:
regs=registartions.set_index('Name')
regs

        reg_id
Name
Wang         1
Claire       2
Andrew       3
Davide       4

In [54]:
pd.merge(regs,logins,left_index=True,right_on='Name')

   reg_id  log_id    Name
3       1       4    Wang
1       3       2  Andrew

In [55]:
pd.merge(logins,regs,right_index=True,left_on="Name")

   log_id    Name  reg_id
1       2  Andrew       3
3       4    Wang       1

### Dealing with differing key column names in joinded tables

In [56]:
regs=regs.reset_index()

In [57]:
regs

     Name  reg_id
0    Wang       1
1  Claire       2
2  Andrew       3
3  Davide       4

In [63]:
regs.columns=['reg_Name','reg_id',]

In [64]:
regs

  reg_Name  reg_id
0     Wang       1
1   Claire       2
2   Andrew       3
3   Davide       4

In [65]:
pd.merge(regs,logins,left_on='reg_Name',right_on='Name')

  reg_Name  reg_id  log_id    Name
0     Wang       1       4    Wang
1   Andrew       3       2  Andrew

In [67]:
pd.merge(regs,logins,left_on='reg_Name',right_on='Name').drop('Name',axis=1)

  reg_Name  reg_id  log_id
0     Wang       1       4
1   Andrew       3       2

### Pandas automatically tags duplicate columns

In [69]:
regs.columns = ['names','id']

In [73]:
logins.columns = ['id','names']

In [74]:
regs

    names  id
0    Wang   1
1  Claire   2
2  Andrew   3
3  Davide   4

In [75]:
logins

   id    names
0   1   Xavire
1   2   Andrew
2   3  Yolanda
3   4     Wang

In [76]:
# _x is for left
# _y is for right
pd.merge(regs,logins,on='names')

    names  id_x  id_y
0    Wang     1     4
1  Andrew     3     2

In [77]:
pd.merge(regs,logins,on='names',suffixes=('_reg','_log'))

    names  id_reg  id_log
0    Wang       1       4
1  Andrew       3       2